# Week 1 Solution

By Jaydeep Dholakia


## Numpy

### Q1. Create an array having consecutive natural numbers of size 6x3 and print it.

In [1]:
import numpy as np

In [6]:
q1_array = np.arange(18).reshape(6,3)
print(q1_array)

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]
 [12 13 14]
 [15 16 17]]

### Q2: Rename alll the coumns in the dataset as per your wish and save it in another dataframe and name it df2

In [7]:
import pandas as pd

In [24]:
df = pd.read_excel("Week 1 Dataset.xlsx")
df.head()

  Name  Income per month          State  Age Sex  Number of siblings
0    A                50     Tamil Nadu   23   M                   0
1    B                34      Karnataka   37   F                   3
2    C                54     Tamil Nadu   35   F                   1
3    D                24  Uttar Pradesh   26   F                   4
4    E                19          Bihar   59   M                   5

In [27]:
df2 = df.rename(columns = {"Name" : "Person_Name",
                                    "Income per month" : "Income_pm",
                                    "State" : "State_Name",
                                   "Age" : "Person_Age",
                                   "Sex" : "Gender", "Number of siblings" : "No. of siblings"})

df2.head()

  Person_Name  Income_pm     State_Name  Person_Age Gender  No. of siblings
0           A         50     Tamil Nadu          23      M                0
1           B         34      Karnataka          37      F                3
2           C         54     Tamil Nadu          35      F                1
3           D         24  Uttar Pradesh          26      F                4
4           E         19          Bihar          59      M                5

### Q3: After you have created df2, make the same changes in the original dataframe using the inplace.

In [42]:
df.rename(columns = {"Name" : "Person_Name",
                                    "Income per month" : "Income_pm",
                                    "State" : "State_Name",
                                   "Age" : "Person_Age",
                                   "Sex" : "Gender", "Number of siblings" : "No. of siblings"}, inplace=True)
df

  Person_Name  Income_pm     State_Name  Person_Age Gender  No. of siblings
0           A         50     Tamil Nadu          23      M                0
1           B         34      Karnataka          37      F                3
2           C         54     Tamil Nadu          35      F                1
3           D         24  Uttar Pradesh          26      F                4
4           E         19          Bihar          59      M                5
5           F         21          Bihar          48      M                6
6           G         40          Delhi          30      F                2
7           H         20  Uttar Pradesh          72      M               10
8           I         30      Telangana          22      F                0
9           J         18    Chattisgarh          42      M                7

### Q4: Show only the columns information, sex and number of siblings.

In [59]:
df[["Gender", "No. of siblings"]]

  Gender  No. of siblings
0      M                0
1      F                3
2      F                1
3      F                4
4      M                5
5      M                6
6      F                2
7      M               10
8      F                0
9      M                7

### Q5: Use iloc method to print data from column 1 to 4 and rows 3 to 9

In [69]:
df.iloc[2:10,0:5]

  Person_Name  Income_pm     State_Name  Person_Age Gender
2           C         54     Tamil Nadu          35      F
3           D         24  Uttar Pradesh          26      F
4           E         19          Bihar          59      M
5           F         21          Bihar          48      M
6           G         40          Delhi          30      F
7           H         20  Uttar Pradesh          72      M
8           I         30      Telangana          22      F
9           J         18    Chattisgarh          42      M

### Q6: Find the total value count of number of siblings in the given dataset

In [82]:
df["No. of siblings"].sum()

38

### Q7: What are dependent and independent varibles in our dataset?

Independent Variables: Name, Icome per month, State, Age, Sex
Dependent Variables: Number of siblings